spa/cypress/fixtures/donations/donation-flagged.json

{
    "id": 1,
    "contributor_email": "testing@test.net",
    "created": "2021-06-04T10:58:46.514460Z",
    "modified": "2021-06-04T10:58:46.514460Z",
    "amount": 12000,
    "currency": "usd",
    "reason": "Testing reason.",
    "interval": "one_time",
    "flagged_date": "2021-06-04T10:58:46.514460Z",
    "formatted_payment_provider_used": "Stripe",
    "payment_provider_data": null,
    "provider_payment_url": "https://dashboard.stripe.com/payments/pi_123",
    "provider_customer_url": "https://dashboard.stripe.com/customers/cus_123",
    "provider_subscription_url": "https://dashboard.stripe.com/subscriptions/pm_123",
    "last_payment_date": "2021-06-04T11:58:46.514460Z",
    "bad_actor_score": 4,
    "bad_actor_response": null,
    "status": "flagged",
    "contributor": 18,
    "donation_page": null,
    "organization": 14
}
